Revit 2017 API
ExportUtils Members
The ExportUtils type exposes the following members.
Methods
Name | Description
GetExportId
 Retrieves the GUID representing this element in DWF and IFC export.
GetGBXMLDocumentId
 Retrieves the GUID representing this document in exported gbXML files.
GetNurbsSurfaceDataForFace
 Returns the necessary information to define a NURBS surface for a given Revit HermiteFace or RuledFace.
See Also
ExportUtils Class
Autodesk.Revit.DB Namespace